rails-tdd/app/controllers/accounts_controller.rb

INSERT INTO "accounts" ("name", "email", "vip", "days_to_pay", "country", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @account = Account.new(account_params)

    if @account.save